<policy>
	<general>
		<name>19_Install Latest %NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
		<trigger_other>InitialConfig</trigger_other>
		<frequency>Once per computer</frequency>
	</general>
	<scope>
		<all_computers>true</all_computers>
	</scope>
	<package_configuration>
		<packages>
			<size>1</size>
			<package>
				<name>%pkg_name%</name>
				<action>Install</action>
			</package>
		</packages>
	</package_configuration>
	<scripts>
		<size>1</size>
		<script>
			<name>%SCRIPT_NAME%</name>
			<priority>%SCRIPT_PRIORITY%</priority>
			<parameter4>%PARAMETER4_VALUE%</parameter4>
			<parameter5>%PARAMETER5_VALUE%</parameter5>
			<parameter6/>
			<parameter7/>
			<parameter8/>
			<parameter9/>
			<parameter10/>
			<parameter11/>
		</script>
	</scripts>
	<self_service>
		<use_for_self_service>false</use_for_self_service>
		<install_button_text>Install</install_button_text>
		<self_service_display_name>%Install Latest %NAME%</self_service_display_name>
		<reinstall_button_text>Reinstall</reinstall_button_text>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<maintenance>
		<recon>false</recon>
	</maintenance>
</policy>