<?xml version="1.0" encoding="UTF-8"?>
<policy>
	<general>
		<name>Self Service Install Latest %NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<computer_groups>
			<computer_group>
				<name>%GROUP_NAME%</name>
			</computer_group>
		</computer_groups>
	</scope>
	<package_configuration>
		<packages>
			<size>1</size>
			<package>
				<name>%pkg_name%</name>
				<action>Install</action>
			</package>
		</packages>
	</package_configuration>
	<scripts>
		<size>1</size>
		<script>
			<name>%SCRIPT_NAME%</name>
			<priority>%SCRIPT_PRIORITY%</priority>
			<parameter4>%PARAMETER4_VALUE%</parameter4>
			<parameter5>%PARAMETER5_VALUE%</parameter5>
			<parameter6/>
			<parameter7/>
			<parameter8/>
			<parameter9/>
			<parameter10/>
			<parameter11/>
		</script>
	</scripts>
	<self_service>
		<use_for_self_service>true</use_for_self_service>
		<install_button_text>%INSTALL_BUTTON_TEXT%</install_button_text>
		<reinstall_button_text>%REINSTALL_BUTTON_TEXT%</reinstall_button_text>
		<self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
